j-shirazi/ArduinoHondaOBD_Extra/hobd_uni_S2000_stm32/hobd_uni_S2000_stm32.ino
/*
Forked and additions made by @mr-sneezy
Editing and suggestions by @micooke
Original Author:
- Philip Bordado (kerpz@yahoo.com)
Hardware:
- Arduino Nano
- 3x Dallas DS18B20 OneWire temp sensors
- HC-05 Bluetooth module at pin 10 (Rx) pin 11 (Tx)
- LCD(K-line) at pin 12
- Voltage divider @ 12v Car to pin A0 (680k ohms and 220k ohms)

Software:
- Arduino 1.6.5r5

Formula:
- IMAP = RPM * MAP / IAT / 2
- MAF = (IMAP/60)*(VE/100)*(Eng Disp)*(MMA)/(R)
Where: VE = 80% (Volumetric Efficiency), R = 8.314 J/°K/mole, MMA = 28.97 g/mole (Molecular mass of air)
http://www.lightner.net/obd2guru/IMAP_AFcalc.html
http://www.installuniversity.com/install_university/installu_articles/volumetric_efficiency/ve_computation_9.012000.htm
*/

//STM32 mini ('blue pill' maple mini clone)//        +------+=====+-----+//        |      | USB |     |//SS2   31|PB12  +-----+  GND|//SCK2  30|PB13           GND|//MISO2 29|PB14           3V3|//MOSI2 28|PB15           RST|//      27|PA8           PB11|0  RX3 SDA2 //TX1   26|PA9           PB10|1  TX3 SCL2//RX1   25|PA10           PB1|33//      24|PA11           PB0|3  A0//      23|PA12           PA7|4  A1 MOSI1//      20|PA15           PA6|5  A2 MISO1//      19|PB3            PA5|6  A3 SCK1//      18|PB4            PA4|7  A4 SS1//      17|PB5            PA3|8  A5 RX2//SCL1  16|PB6            PA2|9  A6 TX2//SDA1  15|PB7            PA1|10 A7//      32|PB8            PA0|11 A8//        |PB9           PC15|12//        |5V            PC14|13//        |GND           PC13|14//        |3V3           VBAT|//        |  []  []  []  []  |//        | 3V3 DIO DCLK GND |//        +------------------+

#include <Arduino.h>
#include <LiquidCrystal.h>

//SNEEZY HACKING - Additions for 3x Dallas 1-wire temp sensors on a bus (async mode).
#include <OneWire.h> // https://github.com/PaulStoffregen/OneWire
#include <DallasTemperature.h> // https://github.com/milesburton/Arduino-Temperature-Control-Library

#define OBD2_BUFFER_LENGTH 20

// 0 - no serial output
// 1 - serial output
// 2 - serial output with bluetooth command -> ecu command test
#define _DEBUG 1

// Data wire is plugged into pin 2 on the Arduino
#define ONE_WIRE_BUS 2

// Setup a oneWire instance to communicate with any OneWire devices
OneWire oneWire(ONE_WIRE_BUS);

// Pass our oneWire reference to Dallas Temperature.
DallasTemperature sensors(&oneWire);

// Assign the addresses of your own 1-Wire temp sensors.
// See the tutorial on how to obtain these addresses:
// http://www.hacktronics.com/Tutorials/arduino-1-wire-address-finder.html
DeviceAddress Sensor1_Thermometer =
{ 0x28, 0xFF, 0x0C, 0x1B, 0xA3, 0x15, 0x04, 0xA5 };
DeviceAddress Sensor2_Thermometer =
{ 0x28, 0xFF, 0x0F, 0x4B, 0xA3, 0x15, 0x04, 0x33 };
DeviceAddress Sensor3_Thermometer =
{ 0x28, 0xFF, 0x75, 0x70, 0xA3, 0x15, 0x01, 0x00 };

// input signals: ign, door
// output signals: alarm horn, lock door, unlock door, immobilizer

/*
* LCD RS pin 9
* LCD Enable pin 8
* LCD D4 pin 7
* LCD D5 pin 6
* LCD D6 pin 5
* LCD D7 pin 4
* LCD R/W pin to ground
* 10K potentiometer:
* ends to +5V and ground
* wiper to LCD VO pin (pin 3)
*/
LiquidCrystal lcd(9, 8, 7, 6, 5, 4);

//SNEEZY HACKING - Button stuff
// set pin numbers:
const uint8_t buttonPin = 3;      // the number of the pushbutton pin
const uint8_t ledPin =  13;       // the number of the LED pin

bool Led_State = LOW;          // the current state of the output pin
bool Old_Button_State = LOW;   // the previous reading from the input pin
//bool Screen_Number = LOW;      // the LCD screen to show
bool Screen_Number = false;   // the LCD screen to show
//uint8_t DS18B20_1 = 0;               //global variable for ext temp sensor.

uint32_t t0 = 0, tLastBluetooth = 0;
enum state {DATA_ERROR, DATA, NO_DATA, RESET, OK};

//Variables for temperature sensor readings and calculations.

#define btSerial Serial1 //(10,11); // RX, TX
#define ecuSerial Serial2 //(12, 12);

#define debugSerial Serial

#if (_DEBUG > 0)
#define DebugPrint(x) debugSerial.print(x)
#define DebugPrintln(x) debugSerial.println(x)
#define DebugPrintHex(x) debugSerial.print(x, HEX)
#else
#define DebugPrint(x)
#define DebugPrintln(x)
#define DebugPrintHex(x)
#endif

bool lcd_mode = true;
bool elm_mode = false;
//bool elm_memory = false; // UNUSED
//bool elm_echo = false;  // UNUSED
//bool elm_space = false; // UNUSED
//bool elm_linefeed = false; // UNUSED
//bool elm_header = false; // UNUSED
byte hobd_protocol = 2; // 0 = obd0, 1 = obd1, 2 = obd2
bool pin_13 = false;
uint8_t  elm_protocol = 0; // auto

#if defined(__STM32F1__)
uint8_t ADCL, ADCH, ADCSRA, ADSC;
#define bit_is_set(x,y) (x&y > 0)
#endif
// function declarations
///////

// Convert 4 digit character array to its decimal value
// i.e. CharArrayToDec("23A3") = 9123
uint16_t CharArrayToDec(const char * in, const uint8_t length = 4);

// Convert a single hex character to its decimal value
// i.e. CharToDec("A") = 10
uint8_t CharToDec(const char &in);

// process bt command for the ecu
// processBluetoothCommand("0100", 4); // OBD2 Mode 1 command
void processBluetoothCommand(const char * btdata1, const uint8_t &command_length);

// Read 1.1V reference against AVcc
uint8_t readVoltage(void)
{
   // set the reference to Vcc and the measurement to the internal 1.1V reference
   #if defined(__AVR_ATmega32U4__) || defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
   ADMUX = _BV(REFS0) | _BV(MUX4) | _BV(MUX3) | _BV(MUX2) | _BV(MUX1);
   #elif defined (__AVR_ATtiny24__) || defined(__AVR_ATtiny44__) || defined(__AVR_ATtiny84__)
   ADMUX = _BV(MUX5) | _BV(MUX0);
   #elif defined (__AVR_ATtiny25__) || defined(__AVR_ATtiny45__) || defined(__AVR_ATtiny85__)
   ADMUX = _BV(MUX3) | _BV(MUX2);
   #elif defined(__STM32F1__)
   return 0;
   #else
   ADMUX = _BV(REFS0) | _BV(MUX3) | _BV(MUX2) | _BV(MUX1);
   #endif
   
   delay(2); // Wait for Vref to settle
   ADCSRA |= _BV(ADSC); // Start conversion
   while (bit_is_set(ADCSRA,ADSC)); // measuring
   
   uint8_t low  = ADCL; // must read ADCL first - it then locks ADCH
   uint8_t high = ADCH; // unlocks both
   
   long vcc = (high<<8) | low;
   
   //result = 1125300L / result; // Calculate Vcc (in mV); 1125300 = 1.1*1023*1000
   vcc = 1125.3 / vcc; // Calculate Vcc (in mV); 1125300 = 1.1*1023*1000
   
   // kerpz haxx
   float R1 = 680000.0; // Resistance of R1 (680kohms)
   float R2 = 220000.0; // Resistance of R2 (220kohms)
   return (((analogRead(14) * vcc) / 1024.0) / (R2/(R1+R2))) * 10.0; // conversion & voltage divider
}

void bt_write(char *str)
{
   while (*str != '\0')
   btSerial.write(*str++);
}

