j-shirazi/ArduinoHondaOBD_Extra/hobd_uni_S2000_stm32/hobd_uni_S2000_stm32.ino
void ecuInit()
{
   ecuSerial.write(0x68);
   ecuSerial.write(0x6a);
   ecuSerial.write(0xf5);
   ecuSerial.write(0xaf);
   ecuSerial.write(0xbf);
   ecuSerial.write(0xb3);
   ecuSerial.write(0xb2);
   ecuSerial.write(0xc1);
   ecuSerial.write(0xdb);
   ecuSerial.write(0xb3);
   ecuSerial.write(0xe9);
}

state ecuCommand(byte cmd, byte num, byte loc, byte len, byte (&data)[OBD2_BUFFER_LENGTH])
{
   byte crc = (0xFF - (cmd + num + loc + len - 0x01)); // checksum FF - (cmd + num + loc + len - 0x01)

   unsigned long timeOut = millis() + 250; // timeout @ 250 ms
   // Not needed, all arrays passed to this function have been initialised as all zeros
   // memset(data, 0, sizeof(data) * OBD2_BUFFER_LENGTH);

   ecuSerial.write(cmd);  // header/cmd read memory ??
   ecuSerial.write(num);  // num of bytes to send
   ecuSerial.write(loc);  // address
   ecuSerial.write(len);  // num of bytes to read
   ecuSerial.write(crc);  // checksum
   
   int i = 0;
   while (i < (len+3) && millis() < timeOut)
   {
      if (ecuSerial.available())
      {
         data[i] = ecuSerial.read();
         i++;
      }
   }

   // or use checksum?
   if (data[0] != 0x00 && data[1] != (len+3))
   {
      return DATA_ERROR; // invalid data error
   }
   if (i < (len+3))
   { // timeout
      return NO_DATA; // timeout error
   }
   return DATA; // success
}

void procbtSerial(void)
{
   // initialise all arrays as zeros
   char btdata1[OBD2_BUFFER_LENGTH] = {0};  // bt data in buffer
   
   uint8_t command_length = 0;
   
   // get the command string
   while (command_length < 20)
   {
      if (btSerial.available())
      {
         btdata1[command_length] = toupper(btSerial.read());
         if (btdata1[command_length] == '\r')
         { // terminate at \r
            btdata1[command_length] = '\0';
            break;
         }
         else if (btdata1[command_length] != ' ')
         { // ignore space
            ++command_length;
         }
      }
   }
   
   DebugPrint(F("BT Command :>"));
   DebugPrint(btdata1);
   DebugPrint(F("< Length = "));
   DebugPrintln(command_length);
   
   processBluetoothCommand(btdata1, command_length);
}

void processBluetoothCommand(const char * btdata1, const uint8_t &command_length)
{
   char btdata2[OBD2_BUFFER_LENGTH] = {0};  // bt data out buffer
   byte ecudata[OBD2_BUFFER_LENGTH] = {0};  // ecu data buffer
   
   state response = NO_DATA; // Default response = NO DATA
   
   /// ELM327 (Hayes modem style) AT commands
   if (!strcmp(btdata1, "ATD"))
   {
      response = OK;
   }//               print id / general | reset all / general
   else if (!strcmp(btdata1, "ATI"))
   {
      response = RESET;
   }
   else if (!strcmp(btdata1, "ATZ"))
   {
      response = RESET;
   }
   // echo on/off / general
   else if (command_length == 4 && strstr(btdata1, "ATE"))
   {
      //elm_echo = (btdata1[3] == '1' ? true : false);
      response = OK;
   }
   // line feed on/off / general
   else if (command_length == 4 && strstr(btdata1, "ATL"))
   {
      //elm_linefeed = (btdata1[3] == '1' ? true : false);
      response = OK;
   }
   // memory on/off / general
   else if (command_length == 4 && strstr(btdata1, "ATM"))
   {
      //elm_memory = (btdata1[3] == '1' ? true : false);
      response = OK;
   }
   // space on/off / obd
   else if (command_length == 4 && strstr(btdata1, "ATS"))
   {
      //elm_space = (btdata1[3] == '1' ? true : false);
      response = OK;
   }
   // headers on/off / obd
   else if (command_length == 4 && strstr(btdata1, "ATH"))
   {
      //elm_header = (btdata1[3] == '1' ? true : false);
      response = OK;
   }
   // set protocol to ? and save it / obd
   else if (command_length == 5 && strstr(btdata1, "ATSP"))
   {
      //elm_protocol = atoi(data[4]);
      response = OK;
   }
   // display protocol / obd
   else if (!strcmp(btdata1, "ATDP"))
   {
      sprintf(btdata2, "AUTO\r\n>");
      response = DATA;
   }
   // read voltage in float / volts
   else if (!strcmp(btdata1, "ATRV"))
   {
      const uint8_t volt2 = readVoltage();
      sprintf(btdata2, "%2d.0V\r\n>", volt2);
      response = DATA;
   }
   // set hobd protocol
   else if (command_length == 6 && strstr(btdata1, "ATSHP"))
   {
      if (btdata1[5] == '0') hobd_protocol = 0;
      if (btdata1[5] == '1') hobd_protocol = 1;
      if (btdata1[5] == '2') hobd_protocol = 2;
      response = OK;
   }
   // get hobd protocol
   else if (!strcmp(btdata1, "ATDHP"))
   {
      sprintf(btdata2, "HOBD%d\r\n>", hobd_protocol);
      response = DATA;
   }
   // pin 13 test
   else if (command_length == 5 && strstr(btdata1, "AT13"))
   {
      if (btdata1[4] == 'T')
      {
         pin_13 = !pin_13;
      }
      else
      {
         pin_13 = (bool)btdata1[4];
      }
      
      digitalWrite(13, pin_13);
      
      response = OK;
   }
   // door lock signal @ D17 / A3
   else if (!strcmp(btdata1, "AT17"))
   {
      digitalWrite(17, HIGH);
      delay(1000);
      digitalWrite(17, LOW);
      response = OK;
   }
   // door unlock signal @ D18 / A4
   else if (!strcmp(btdata1, "AT18"))
   {
      digitalWrite(18, HIGH);
      delay(1000);
      digitalWrite(18, LOW);
      response = OK;
   }
   // clear dtc / stored values SNEEZY NOTE - OBD2 Mode 04 (clear DTC memory and MIL)
   else if (!strcmp(btdata1, "04"))
   {
      response = ecuCommand(0x21, 0x04, 0x01, 0x00, ecudata); // reset ecu
   }
   // Numeric (HEX) command
   ///   01XX : OBD2 Mode 1 commands
   /// 02FFXX : OBD2 custom Extended PID commands
   else
   {
      uint16_t OBD2_Command = CharArrayToDec(btdata1, command_length);
      
      DebugPrintln(F("##########"));
      DebugPrint(F("OBD2 Command : "));
      DebugPrint(btdata1);
      DebugPrint(F(" => "));
      DebugPrintHex( OBD2_Command);
      DebugPrintln("");
      DebugPrintln(F("##########"));
      
      float Temperature = 0;
      
      response = DATA; // Change default response to DATA
      
      switch (OBD2_Command)
      {
         ///   01XX : OBD2 Mode 1 commands
         ///
         // Requests 4 byte indicating if any of the next 32 PIDs are available (used by the ECU).
         // Programmer to calculate https://en.wikipedia.org/wiki/OBD-II_PIDs#Mode_1_PID_00
         case 0x0100:
         sprintf(btdata2, "41 00 BE 3E B0 11\r\n>");
         response = DATA;
         // dtc / AA BB CC DD / A7 = MIL on/off, A6-A0 = DTC_CNT
         break;
         case 0x0101:
         response = ecuCommand(0x20, 0x05, 0x0B, 0x01, ecudata);
         if (response == DATA)
         {
            byte a = ((ecudata[2] >> 5) & 1) << 7; // get bit 5 on ecudata[2], set it to a7
            sprintf(btdata2, "41 01 %02X 00 00 00\r\n>", a);
         }
         break;
         // freeze dtc / 00 61 ???
         case 0x0102:
         /*
         response = ecuCommand(0x20, 0x05, 0x98, 0x02, ecudata);
         if (response == DATA)
         {
         sprintf(btdata2, "41 02 %02X %02X\r\n>", ecudata[2], ecudata[3]);
         }
         */
         response = NO_DATA;
         break;
         case 0x0103: // fuel system status / 01 00 ???
         //response = ecuCommand(0x20, 0x05, 0x0F, 0x01, ecudata);
         //if (response == DATA)
         //{ // flags
         //  byte a = ecudata[2] & 1; // get bit 0 on ecudata[2]
         //  a = (ecudata[2] == 1 ? 2 : 1); // convert to comply obd2
         //  sprintf(btdata2, "41 03 %02X 00\r\n>", a);
         // }
         response = ecuCommand(0x20, 0x05, 0x9a, 0x02, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "41 03 %02X %02X\r\n>", ecudata[2], ecudata[3]);
         }
         break;
         case 0x0104: // engine load (%)
         response = ecuCommand(0x20, 0x05, 0x9c, 0x01, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "41 04 %02X\r\n>", ecudata[2]);
         }
         break;
         case 0x0105: // ect (°C)
         response = ecuCommand(0x20, 0x05, 0x10, 0x01, ecudata);
         if (response == DATA)
         {
            float f = ecudata[2];
            f = 155.04149 - f * 3.0414878 + pow(f, 2) * 0.03952185 - pow(f, 3) * 0.00029383913 + pow(f, 4) * 0.0000010792568 - pow(f, 5) * 0.0000000015618437;
            ecudata[2] = round(f) + 40; // A-40
            sprintf(btdata2, "41 05 %02X\r\n>", ecudata[2]);
         }
         break;
         case 0x0106: // short FT (%)
         response = ecuCommand(0x20, 0x05, 0x20, 0x01, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "41 06 %02X\r\n>", ecudata[2]);
         }
         break;
         case 0x0107: // long FT (%)
         response = ecuCommand(0x20, 0x05, 0x22, 0x01, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "41 07 %02X\r\n>", ecudata[2]);
         }
         break;
         // case 0x010A: // fuel pressure
         //btSerial.print("41 0A EF\r\n");
         //response = DATA;
         //break;
         case 0x010B: // map (kPa)
         response = ecuCommand(0x20, 0x05, 0x12, 0x01, ecudata);
         if (response == DATA)
         {
            ecudata[2] = (ecudata[2] * 69)/100;   //Sneezy Note - Convert what seems to be 10xPSI into kPa for OBD2 compatibility (PSI to kPa = PSI x 6.9).
            sprintf(btdata2, "41 0B %02X\r\n>", ecudata[2]);

