j-shirazi/ArduinoHondaOBD_Extra/hobd_uni_S2000_stm32/hobd_uni_S2000_stm32.ino
         }
         break;
         case 0x010C: // rpm
         response = ecuCommand(0x20, 0x05, 0x00, 0x02, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "41 0C %02X %02X\r\n>", ecudata[2], ecudata[3]);
         }
         break;
         case 0x010D: // vss (km/h)
         response = ecuCommand(0x20, 0x05, 0x02, 0x01, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "41 0D %02X\r\n>", ecudata[2]);
         }
         break;
         case 0x010E: // timing advance (°)
         response = ecuCommand(0x20, 0x05, 0x26, 0x01, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "41 0E %02X\r\n>", ecudata[2]);
         }
         break;
         case 0x010F: // iat (°C)
         response = ecuCommand(0x20, 0x05, 0x11, 0x01, ecudata);
         if (response == DATA)
         {
            float f = ecudata[2];
            f = 155.04149 - f * 3.0414878 + pow(f, 2) * 0.03952185 - pow(f, 3) * 0.00029383913 + pow(f, 4) * 0.0000010792568 - pow(f, 5) * 0.0000000015618437;
            ecudata[2] = round(f) + 40; // A-40
            sprintf(btdata2, "41 0F %02X\r\n>", ecudata[2]);
         }
         break;
         case 0x0111: // tps (%)
         response = ecuCommand(0x20, 0x05, 0x14, 0x01, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "41 11 %02X\r\n>", ecudata[2]);
         }
         break;
         case 0x0113: // o2 sensor present ???
         sprintf(btdata2, "41 13 80\r\n>"); // 10000000 / assume bank 1 present
         break;
         case 0x0114: // o2 (V)
         response = ecuCommand(0x20, 0x05, 0x15, 0x01, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "41 14 %02X FF\r\n>", ecudata[2]);
         }
         break;
         case 0x011C: // obd2
         sprintf(btdata2, "41 1C 01\r\n>");
         break;
         case 0x0120:
         //SNEEZY NOTE - forth byte of "01h" just flags that the next set of 32 bit flags is used (with some bits valid)
         sprintf(btdata2, "41 20 00 00 00 01\r\n>");
         break;
         case 0x012F: // fuel level (%)
         //  sprintf(btdata2, "41 2F FF\r\n>"); // max
         break;
         case 0x0130:
         //SNEEZY NOTE - forth byte of "01h" just flags that the next set of 32 bit flags is used (with some bits valid), first byte has some valid flags.
         sprintf(btdata2, "41 30 20 00 00 01\r\n>");
         break;
         case 0x0133: // baro (kPa)
         response = ecuCommand(0x20, 0x05, 0x13, 0x01, ecudata);
         if (response == DATA)
         {
            ecudata[2] = (ecudata[2] * 69)/100;   //Sneezy Note - Convert what seems to be 10xPSI into kPa for OBD2 compatibility (PSI to kPa = PSI x 6.9).
            sprintf(btdata2, "41 33 %02X\r\n>", ecudata[2]);
         }
         break;
         case 0x0140:
         //SNEEZY NOTE - first byte has some valid flags, also one in the last byte, no further supported PIDs.
         sprintf(btdata2, "41 40 48 00 00 10\r\n>");
         break;
         case 0x0142: // ecu voltage (V)
         response = ecuCommand(0x20, 0x05, 0x17, 0x01, ecudata);
         if (response == DATA)
         {
            float f = ecudata[2];
            f = f / 10.45;
            uint16_t u = f * 1000; // ((A*256)+B)/1000
            sprintf(btdata2, "41 42 %02X %02X\r\n>", highByte(u), lowByte(u));
         }
         break;
         case 0x0145: // iacv / relative throttle position
         response = ecuCommand(0x20, 0x05, 0x28, 0x01, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "41 45 %02X\r\n>", ecudata[2]);
         }
         break;
         // Added for Engine Oil Temp sensor (my external One Wire DS18B20)
         case 0x015C: // EOT - Engine Oil Temp
         // OBD2 sensor conversion EOT = A - 40, so add 40 to balance it, + 0.5 for rounding up
         Temperature = getTemperature(Sensor1_Thermometer) + 40.5;
         sprintf(btdata2, "41 5C %02X\r\n>", (byte)Temperature);	// Send the sensor temp; typecast from a float to an uint8_t / byte / unsigned char
         response = DATA;
         break;
         /// OBD2 custom Extended PID commands
         ///
         // NOTE : Had to go to THREE BYTES because two byte custom PIDs are too short for
         // Torque Pros Extended PID parsing (so added FF in the middle of the response)
         //
         //  All 0x20XX commands below are actually 0x20FFXX, the FF is ignored for this switch statement
         // (See CharArrayToDec() function )
         // Additional custom PIDs for Dallas temperature sensor
         case 0x2002: // Gear Temperature
         Temperature = getTemperature(Sensor2_Thermometer);   //OBD2 sensor conversion (no conversion)
         sprintf(btdata2, "60 FF 02 %02X\r\n>", (byte)Temperature);  // Send the sensor temp; typecast from a float to an uint8_t / byte / unsigned char
         response = DATA;
         break;
         case 0x2003: //  Diff Temperature
         Temperature = getTemperature(Sensor3_Thermometer);   //OBD2 sensor conversion (no conversion)
         sprintf(btdata2, "60 FF 03 %02X\r\n>", (byte)Temperature);  // Send the sensor temp; typecast from a float to an uint8_t / byte / unsigned char
         response = DATA;
         break;
         case 0x2008: // custom hobd mapping / flags
         response = ecuCommand(0x20, 0x05, 0x08, 0x01, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "60 FF 08 %02X\r\n>", ecudata[2]);
         }
         break;
         case 0x2009: // custom hobd mapping / flags
         response = ecuCommand(0x20, 0x05, 0x09, 0x01, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "60 FF 09 %02X\r\n>", ecudata[2]);
         }
         break;
         case 0x200A:  // custom hobd mapping / flags
         response = ecuCommand(0x20, 0x05, 0x0A, 0x01, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "60 FF 0A %02X\r\n>", ecudata[2]);
         }
         break;
         case 0x200B: // custom hobd mapping / flags
         //sprintf(btdata2, "60 0C AA\r\n>"); // 10101010 / test data
         response = ecuCommand(0x20, 0x05, 0x0B, 0x01, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "60 FF 0B %02X\r\n>", ecudata[2]);
         }
         break;
         case 0x200C:  // custom hobd mapping / flags
         response = ecuCommand(0x20, 0x05, 0x0C, 0x01, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "60 FF 0C %02X\r\n>", ecudata[2]);
         }
         break;
         case 0x200D:  // custom hobd mapping / flags
         response = ecuCommand(0x20, 0x05, 0x0D, 0x01, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "60 FF 0D %02X\r\n>", ecudata[2]);
         }
         break;
         case 0x200E:  // custom hobd mapping / flags
         response = ecuCommand(0x20, 0x05, 0x0E, 0x01, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "60 FF 0E %02X\r\n>", ecudata[2]);
         }
         break;
         case 0x200F:   // custom hobd mapping / flags
         response = ecuCommand(0x20, 0x05, 0x0F, 0x01, ecudata);
         if (response == DATA)
         {
            sprintf(btdata2, "60 FF 0F %02X\r\n>", ecudata[2]);
         }
         break;
         default:
         response = NO_DATA;
      }
   }
   
   switch(response)
   {
      case RESET:
      sprintf(btdata2, "Honda OBD v1.0\r\n>"); break;
      case OK:
      sprintf(btdata2, "OK\r\n>"); break;
      case DATA_ERROR:
      sprintf(btdata2, "DATA ERROR\r\n>"); break;
      case NO_DATA:
      sprintf(btdata2, "NO DATA\r\n>"); break;
      default: // Default case is DATA - btdata2 is already set (or NULL)
      break;
   }
   
