j-shirazi/ArduinoHondaOBD_Extra/hobd_uni_S2000_stm32/hobd_uni_S2000_stm32.ino
   DebugPrint(F("BT Response >"));
   DebugPrint(btdata2);
   DebugPrintln(F("<"));
   
   bt_write(btdata2); // send response data
}

void lcdPaddedPrint(const uint16_t &in, const uint16_t &len, const bool zero_pad = false)
{
   uint16_t i = in;
   switch (len)
   {
      case 4:
      i %= 10000;
      (i / 1000) ? lcd.print(i / 1000) : (zero_pad & (i < 1000)) ? lcd.print(0) : lcd.print(" ");
      case 3:
      i %= 1000;
      (i / 100) ? lcd.print(i / 100) : (zero_pad & (i < 100)) ? lcd.print(0) : lcd.print(" ");
      case 2:
      i %= 100;
      (i / 10) ? lcd.print(i / 10) : (zero_pad & (i < 10)) ? lcd.print(0) : lcd.print(" ");
      default:
      i %= 10;
      lcd.print(i);
   }
}

void lcdClearSection(const uint8_t &col, const uint8_t &row, const uint8_t &length, const bool &moveFirst = false)
{
   if (moveFirst)
   {
      lcd.setCursor(col,row);
   }
   for (uint8_t i=0;i<length;++i)
   {
      lcd.print(" ");
   }
   lcd.setCursor(col,row);
}

void procecuSerial(void)
{
   //char h_initobd2[12] = {0x68,0x6a,0xf5,0xaf,0xbf,0xb3,0xb2,0xc1,0xdb,0xb3,0xe9}; // 200ms - 300ms delay
   //byte h_cmd1[6] = {0x20,0x05,0x00,0x10,0xcb}; // row 1
   //byte h_cmd2[6] = {0x20,0x05,0x10,0x10,0xbb}; // row 2
   //byte h_cmd3[6] = {0x20,0x05,0x20,0x10,0xab}; // row 3
   //byte h_cmd4[6] = {0x20,0x05,0x76,0x0a,0x5b}; // ecu id
   // Initialise data as all zeros
   byte data[OBD2_BUFFER_LENGTH] = {0};  //Received data from ECU has two byte header, data begins at 3rd byte [2]
   uint16_t rpm=0,vss=0,ect=0,iat=0,maps=0,tps=0;
   //uint16_t baro=0,volt=0,imap=0; // UNUSED
   
   // row 1
   if (ecuCommand(0x20,0x05,0x00,0x10,data))
   {
      //rpm = 1875000 / (data[2] * 256 + data[3] + 1); // OBD1
      rpm = (data[2] * 256 + data[3]) / 4; // OBD2
      vss = data[4];
   }
   
   // row 2
   if(ecuCommand(0x20,0x05,0x10,0x10,data))
   {
      float f;
      f = data[2];
      f = 155.04149 - f * 3.0414878 + pow(f, 2) * 0.03952185 - pow(f, 3) * 0.00029383913 + pow(f, 4) * 0.0000010792568 - pow(f, 5) * 0.0000000015618437;
      ect = round(f);
      f = data[3];
      f = 155.04149 - f * 3.0414878 + pow(f, 2) * 0.03952185 - pow(f, 3) * 0.00029383913 + pow(f, 4) * 0.0000010792568 - pow(f, 5) * 0.0000000015618437;
      iat = round(f);
      maps = data[4]; // data[4] * 0.716-5
      //baro = data[5]; // data[5] * 0.716-5 // UNUSED
      tps = data[6]; // (data[6] - 24) / 2;
      f = data[9];
      f = (f / 10.45) * 10.0; // cV
      //volt = round(f); // UNUSED
      //alt_fr = data[10] / 2.55
      //eld = 77.06 - data[11] / 2.5371
   }
   
   // critical ect value, alarm on
   digitalWrite(13, (ect > 97));
   
   // tps offset, fix haxx
   if (tps < 0) tps = 0;
   //if (tps > 100) tps = 100;
   
   // IMAP = RPM * MAP / IAT / 2
   // MAF = (IMAP/60)*(VE/100)*(Eng Disp)*(MMA)/(R)
   // Where: VE = 80% (Volumetric Efficiency), R = 8.314 J/°K/mole, MMA = 28.97 g/mole (Molecular mass of air)
   //imap = (rpm * maps) / (iat + 273); // UNUSED
   // ve = 75, ed = 1.5.95, afr = 14.7
   //float maf = (imap / 120) * (80 / 100) * 1.595 * 28.9644 / 8.314472; // UNUSED
   
   // Read 1.1V reference against AVcc
   const uint8_t volt2 = readVoltage();
   
   //Use Kerpz original screen - with space padding
   if (Screen_Number == false)
   {  // lcd display format
      //           111111
      // 0123456789012345
      // R0000 S000 V00.0
      // E00 I00 M000 T00
      
      // Line 1
      lcdClearSection(0,0,6,true);
      lcd.print("R");
      lcdPaddedPrint(rpm,4);
      
      lcdClearSection(6,0,5);
      lcd.print("S");
      lcdPaddedPrint(vss,3);
      
      lcdClearSection(11,0,5);
      lcd.print("V");
      lcdPaddedPrint(volt2/10,2);
      lcd.print(".");
      lcd.print(volt2 % 10);

      // Line 2
      lcdClearSection(0,1,4,true);
      lcd.print("E");
      lcdPaddedPrint(ect,2);

      lcdClearSection(4,1,4);
      lcd.print("I");
      lcdPaddedPrint(iat,2);

      lcdClearSection(8,1,5);
      lcd.print("M");
      lcdPaddedPrint(maps,3);
      
      lcdClearSection(13,1,3);
      lcd.print("T");
      lcdPaddedPrint(tps,2);
   }


   //SNEEZY HACKING -
   if (Screen_Number == true)
   {  //Use SNEEZY screen No2

      float Oil_Temp = getTemperature(Sensor1_Thermometer);
      
      // set the cursor to column 0, line 1
      // (note: line 1 is the second row, since counting begins with 0):
      lcd.setCursor(0, 0);
      lcd.print(F("Oil "));
      lcd.print(Oil_Temp, 0);
      lcd.print((char)223); // This display uses a HITACHI ascii table - : http://www.electronic-engineering.ch/microchip/datasheets/lcd/charset.gif

      float Diff_Temp = getTemperature(Sensor2_Thermometer);
      
      // set the cursor to column 0, line 1
      // (note: line 1 is the second row, since counting begins with 0):
      lcd.setCursor(7, 0);
      lcd.print(F(" Dif "));
      lcd.print(Diff_Temp, 0);
      lcd.print((char)223);

      lcd.print(" "); //clear remaining row LCD chars (to avoid use of lcd.clear() as it flickers the screen).

      float Gear_Temp = getTemperature(Sensor3_Thermometer);
      
      // set the cursor to column 0, line 1
      // (note: line 1 is the second row, since counting begins with 0):
      lcd.setCursor(0, 1);
      lcd.print(F("Gbox "));
      lcd.print(Gear_Temp, 1);
      lcd.print((char)223);

      lcd.print(F("      ")); //clear remaining LCD chars (to avoid use of lcd.clear() as it flickers the screen).
      
      Led_State = !Led_State;
      digitalWrite(ledPin, Led_State);  //toggle LED pin for DEBUG
   }
}

void My_Buttons()
{
   const int CURRENT_BUTTON_STATE  = digitalRead(buttonPin);
   if (CURRENT_BUTTON_STATE != Old_Button_State && CURRENT_BUTTON_STATE == HIGH)
   {
      Led_State = !Led_State;
      //  Screen_Number = (Screen_Number == LOW) ? HIGH : LOW;
      Screen_Number = !Screen_Number;  //Toggle screen bool
      digitalWrite(ledPin, Led_State);  //toggle LED pin for DEBUG
      //delay(50);
   }
   Old_Button_State = CURRENT_BUTTON_STATE;
}

float getTemperature(DeviceAddress deviceAddress)
{
   float tempC = sensors.getTempC(deviceAddress);
   if (tempC == -127.00)
   {
      lcd.clear();
      lcd.print(F("Error getting   "));
      lcd.setCursor(0, 1);
      lcd.print(F("temperature     "));
      delay(2000);
      lcd.clear();
   }
   
