j-shirazi/ArduinoHondaOBD_Extra/hobd_uni_S2000_stm32/hobd_uni_S2000_stm32.ino
   return tempC;
}

// Convert 4 digit character array to its decimal value
// i.e. CharArrayToDec("23A3") = 9123
uint16_t CharArrayToDec(const char * in, const uint8_t length)
{
   if (length == 4) // length = 4 : OBD2 Mode 1 commands
   {
      // "0101" -> 0x0101
      return ( CharToDec(in[0])*4096 + /* 16*16*16 = 4096 */
      CharToDec(in[1])*256 +           /* 16*16 = 256 */
      CharToDec(in[2])*16 +
      CharToDec(in[3]) );
   }
   else if (length == 6) // length = 6 : OBD2 custom Extended PID commands
   {
      // "20FF08" -> 0x2008
      return ( CharToDec(in[0])*4096 + /* 16*16*16 = 4096 */
      CharToDec(in[1])*256 +           /* 16*16 = 256 */
      CharToDec(in[4])*16 +
      CharToDec(in[5]) );
   }
   else
   {
      return 0x0000;
   }
}
// Convert a single hex character to its decimal value
// i.e. CharToDec("A") = 10
uint8_t CharToDec(const char &in)
{
   return (in > '9')?(10 + in - 'A'):(in - '0');
}

void setup()
{
   #if ( _DEBUG > 0 )
   debugSerial.begin(9600);
   DebugPrintln(F("Setup"));
   DebugPrintln(F("LCD Mode"));
   #endif
   
   // setup the ECU serial
   ecuSerial.begin(9600);
   
   delay(100);
   ecuInit();
   delay(300);

   // set up the LCD's number of columns and rows:
   lcd.begin(16, 2);

   lcd.clear();
   lcd.setCursor(0, 0);
   lcd.print(F("Honda OBD v1.0"));
   lcd.setCursor(0,1);
   lcd.print(F("LCD 16x2 Mode"));
   
   // Start up the Dallas sensor library
   sensors.begin();
   // set the resolution to 9 bit (good enough?)
   sensors.setResolution(Sensor1_Thermometer, 9);
   sensors.setResolution(Sensor2_Thermometer, 9);
   sensors.setResolution(Sensor3_Thermometer, 9);
   
   // Async type request for temps takes only 2mS, programmer then must take following conversion time into account (and do more useful stuff while waiting).
   sensors.setWaitForConversion(false);  // Makes it async and saves delay time.

   // initialize the LED pin (and others) as an output
   pinMode(13, OUTPUT);
   pinMode(17, OUTPUT);
   pinMode(18, OUTPUT);
   pinMode(ledPin, OUTPUT);
   
   // initialize the pushbutton pin as an input
   pinMode(buttonPin, INPUT);

   // Setup the bluetooth and start it listening
   btSerial.begin(9600);
   
   t0 = millis();

   // Force debug of bluetooth processing
   #if (_DEBUG == 2)
   processBluetoothCommand("ATD", 3);
   processBluetoothCommand("ATI", 3);
   processBluetoothCommand("ATZ", 3);
   processBluetoothCommand("ATE", 4);
   processBluetoothCommand("ATL", 4);
   processBluetoothCommand("ATM", 4);
   processBluetoothCommand("ATS", 4);
   processBluetoothCommand("ATH", 4);
   processBluetoothCommand("ATSP", 5);
   processBluetoothCommand("ATDP", 4);
   processBluetoothCommand("ATRV", 4);
   processBluetoothCommand("ATSHP", 6);
   processBluetoothCommand("ATDHP", 5);
   processBluetoothCommand("AT13", 5);
   processBluetoothCommand("AT17", 4);
   processBluetoothCommand("AT18", 4);
   processBluetoothCommand("04", 2);
   processBluetoothCommand("0100", 4);
   processBluetoothCommand("0101", 4);
   processBluetoothCommand("0102", 4);
   processBluetoothCommand("0103", 4);
   processBluetoothCommand("0104", 4);
   processBluetoothCommand("0105", 4);
   processBluetoothCommand("0106", 4);
   processBluetoothCommand("0107", 4);
   processBluetoothCommand("010A", 4);
   processBluetoothCommand("010B", 4);
   processBluetoothCommand("010C", 4);
   processBluetoothCommand("010D", 4);
   processBluetoothCommand("010E", 4);
   processBluetoothCommand("010F", 4);
   processBluetoothCommand("0111", 4);
   processBluetoothCommand("0113", 4);
   processBluetoothCommand("0114", 4);
   processBluetoothCommand("011C", 4);
   processBluetoothCommand("0120", 4);
   processBluetoothCommand("012F", 4);
   processBluetoothCommand("0130", 4);
   processBluetoothCommand("0133", 4);
   processBluetoothCommand("0140", 4);
   processBluetoothCommand("0142", 4);
   processBluetoothCommand("0145", 4);
   processBluetoothCommand("20FF08", 6);
   processBluetoothCommand("20FF09", 6);
   processBluetoothCommand("20FF0A", 6);
   processBluetoothCommand("20FF0B", 6);
   processBluetoothCommand("20FF0C", 6);
   processBluetoothCommand("20FF0D", 6);
   processBluetoothCommand("20FF0E", 6);
   processBluetoothCommand("20FF0F", 6);
   #endif

   delay(1000); // Show the LCD setup message for 1s
}

void loop()
{
   // read the Temperature sensors
   sensors.requestTemperatures();
   My_Buttons();   //My button check for screen change
   
   // LCD mode with 300ms bluetooth sniff
   if (!elm_mode)
   {
      procecuSerial();
      
      delay(300);
      if (btSerial.available())
      {
         elm_mode = true;
         lcd.clear();
         lcd.setCursor(0, 0);
         lcd.print(F("Honda OBD v1.0"));
         lcd.setCursor(0,1);
         lcd.print(F("Bluetooth Mode"));
         
         DebugPrintln(F("BT Mode"));
         
         procbtSerial();
         
         t0 = millis();
         tLastBluetooth = millis();
      }
   }
   // Bluetooth mode
   else
   //else if (millis() - t0 > 300)
   {
      delay(300);
      if (btSerial.available())
      {
         procbtSerial();
         tLastBluetooth = millis();
      }
      //btSerial.listen();
      
      // t0 = millis();
   }
   
   // If no bluetooth in the last 5 seconds then switch back to LCD mode / Bluetooth search
   if (millis() - tLastBluetooth > 5000)
   {
      elm_mode = false;
      DebugPrintln(F("No bluetooth in 5s"));
      DebugPrintln(F("LCD Mode"));
   }
}
